In [3]:
import pandas as pd
import numpy as np

# csv file format

In [4]:
filepath="/Users/dailinnan/Desktop/csvfile.csv"
df=pd.read_csv(filepath)
df

,John,Doe,120 jefferson st.,Riverside,NJ,08075
0,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
1,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
2,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
3,NaN,Blankman,NaN,SomeTown,SD,298
4,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [5]:
df.columns=["first name","last name","location","city","state","area code"]

In [6]:
df

,first name,last name,location,city,state,area code
0,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
1,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
2,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
3,NaN,Blankman,NaN,SomeTown,SD,298
4,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [7]:
#To select the 0th,1st and 2nd row of "First Name" column only
df.loc[0:2,"first name"]

0             Jack
1    John "Da Man"
2          Stephen
Name: first name, dtype: object

In [8]:
#creating a dataframe
df=pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=['a', 'b', 'c'])
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [9]:
#applying the transform function
df = df.transform(func = lambda x : x + 10)
df

    a   b   c
0  11  12  13
1  14  15  16
2  17  18  19

In [10]:
#applying the transform function to find the square root to each element of the dataframe
result = df.transform(func = ['sqrt'])
result

          a         b         c
       sqrt      sqrt      sqrt
0  3.316625  3.464102  3.605551
1  3.741657  3.872983  4.000000
2  4.123106  4.242641  4.358899

# Json file format

In [14]:
import json

In [15]:
person = {
    'first_name' : 'Mark',
    'last_name' : 'abc',
    'age' : 27,
    'address': {
        "streetAddress": "21 2nd Street",
        "city": "New York",
        "state": "NY",
        "postalCode": "10021-3100"
    }
}

In [16]:
#json.dump() method can be used for writing to JSON file.

#Syntax: json.dump(dict, file_pointer)

#Parameters:

#dictionary – name of the dictionary which should be converted to JSON object.
#file pointer – pointer of the file opened in write or append mode.

with open("person.json","w") as f:
    json.dump(person,f)
    print(f)
type(f)

<_io.TextIOWrapper name='person.json' mode='w' encoding='UTF-8'>

_io.TextIOWrapper

In [17]:
json_object=json.dumps(person,indent=4)
with open("sample.json","w")as outfile:
    outfile.write(json_object)
    print(outfile)
    print(json_object)

<_io.TextIOWrapper name='sample.json' mode='w' encoding='UTF-8'>
{
    "first_name": "Mark",
    "last_name": "abc",
    "age": 27,
    "address": {
        "streetAddress": "21 2nd Street",
        "city": "New York",
        "state": "NY",
        "postalCode": "10021-3100"
    }
}

In [20]:
with open("sample.json","r")as openfile:
    json_object=json.load(openfile)
    print(type(openfile))
print(json_object)
print(type(json_object))

<class '_io.TextIOWrapper'>
{'first_name': 'Mark', 'last_name': 'abc', 'age': 27, 'address': {'streetAddress': '21 2nd Street', 'city': 'New York', 'state': 'NY', 'postalCode': '10021-3100'}}
<class 'dict'>

# Excel file format

In [12]:
import pandas as pd

In [13]:
url="/Users/dailinnan/Desktop/example_10.xlsx"
df_xlsx=pd.read_excel(url)
df_xlsx

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

# XML file format

In [21]:
#....

# read/save other data formats
| Data Formate |        Read       |            Save |
| ------------ | :---------------: | --------------: |
| csv          |  `pd.read_csv()`  |   `df.to_csv()` |
| json         |  `pd.read_json()` |  `df.to_json()` |
| excel        | `pd.read_excel()` | `df.to_excel()` |
| hdf          |  `pd.read_hdf()`  |   `df.to_hdf()` |
| sql          |  `pd.read_sql()`  |   `df.to_sql()` |
| ...          |        ...        |             ... |